{
  "main": {
    "name":"Ryan D",
    "description":"Experienced Software Engineer specialized in automation, web-scraping, full-stack development, and generative AI integration. AWS Certified Solutions Architect CO2",
    "description2":"I built this site with React Javascript for frontend, with Lambdas and API Gateway for backend and I hosted it on AWS",
    "description3": "Refresh the page for a new animation! ;)",
    "image":"profilepic.jpg",
    "bio":"Full-stack web developer specialized in Python Django for backend and React Javascript for frontend. Expert in creating high-performance, scalable automation and web-scraping solutions using Selenium/Playwright, bypassing CAPTCHAs and adept in Docker orchestration. Certified as a AWS Solutions Architect CO2 capable of creating complex cloud-based solutions and enhancing them with generative AI.",
    "contactmessage":"Interested in my work or have a question? Don't hesitate to reach out!",
    "email": "ryan.dundun3@gmail.com",
    "phone": "+1 (414) 559-7852",
    "github":"https://github.com/nordicgiant2/react-nice-resume",
    "project":"https://github.com/nordicgiant2/react-nice-resume",
    "address":{
      "street":"(Your Street)",
      "city":"(Your City)",
      "state":"(Your State)",
      "zip": "(Your Zip/Postal Code)"
    },
    "website": "http://www.timbakerdev.com",
    "resumedownload":"http://timbakerdev.com",
    "social":[
      {
        "name":"instagram",
        "url":"http://instagram.com/dundun",
        "className":"fa fa-instagram"
      },
      {
        "name":"github",
        "url":"https://github.com/ryandundun",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"Git (Github), Python, SQL, Postgres, Django, React, Web-scraping, Selenium automation, BS4, Machine Learning with Scikit-Learn, image classification, CI/CD, Jenkins, Terraform, JavaScript, REST API, Docker, chat GPT/open AI integrations",
    "skillmessage2": "Lambda, EC2, S3, SNS, SQS, RDS, ECS, Elastic Beanstalk, Load Balancers, SMS, SES, Rekognition, Route 53, Comprehend, API Gateway, CloudWatch, EventBridge, Step Functions, Athena, Glue",
    "education":[
      {
        "school":"University of Wisconsin-Madison",
        "degree":"Majors: Statistics & Economics B.S | Minor: Computer Science",
        "graduated":"Graduated Summer 2019",
        "description":"Developed strong critical thinking skills through in-depth data analysis and problem-solving. I excelled in coding, creating innovative solutions for complex challenges, showcasing my ability to merge analytical insight with technical acumen."
      }
    ],
    "work":[
      {
        "company":"Capital One",
        "title":"Senior Software Engineer",
        "years":"2019 - Present",
        "description":"Web-scraped data, automated ETL data processes, deployments, and cloud infrastructure. Programmed, monitored, and did DevOps on full-stack web-development software while working with Agile team using Jira on a variety of applications and services in QA and Production environments. Tech Stack includes Github, AWS, ECS, EC2, S3, RDS, Python, Jenkins (for CI/CD), Route 53, Lambda, Load Balancers, SNS, React, Docker containers.."
      },
      {
        "company":"Vyflow",
        "title":"Co-Founder & CTO",
        "years":"2019",
        "description":"Assembled, designed, and maintained software and service architecture for all of Vyflow’s services and applications that include real-time view-only bank access, data rooms, portfolio management, etc. Vyflow is an incubator startup that raised a seed round of investment. Vyflow provides peace of mind to investors by adding an extra layer of due diligence. Tech stack includes Django Python (backend), React (front end), plaid integration (for banking access), AWS Lambda, S3, EC2, RDS, Route 53, Elastic Beanstalk etc."
      },
      {
        "company":"Quad Graphics",
        "title":"Web Scraper & Data Engineer",
        "years":"2018",
        "description":"Scraped/mined data programmatically (using python selenium and BeautifulSoup) from various sources to be used in prediction/forecasting of trends in business operations. After data was scraped it was processed and transformed with Python Pandas to be stored in AWS S3. Infrastructure included AWS Lambda and EC2."
      }
    ],
    "ventures": [
      {
        "company":"FourKube",
        "title":"Machine Learning & AI Stock Market Algorithm",
        "years":"2020",
        "description":"Engineered FourKube’s machine learning algorithms that generates and records predictions based off of web-scraped data from various sources — 100% automated. FourKube’s stock prediction algorithm strives to identify companies to buy for profit. Software is powered by AWS with Lambda APIs utilizing AWS API Gateway and the live website is created in ReactJS. The software lives on today paper trading daily and running on autopilot - live reporting of on-going performance at: https://www.fourkube.info/. At its peak, had 82 monthly paying subscribers utilizing Stripe."
      }

    ],
    "skills":[
      {
        "name":"Python",
        "level":"90%"
      },
      {
        "name":"Automation & Web-Scraping",
        "level":"95%"
      },
      {
        "name":"Databases & SQL",
        "level":"80%"
      },
      {
        "name":"CI/CD (Jenkins, Git, Terraform, etc)",
        "level":"65%"
      },
      {
        "name":"AWS (EC2, Lambda, S3, SNS, SQS, Route 53, etc)",
        "level":"85%"
      },
      {
        "name":"Full Stack Web development",
        "level":"75%"
      },
      {
        "name":"AI integration",
        "level":"80%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"FourKube: Automated Trading Algorithm, ML, AWS",
        "category":"My Travel Blog for my post-university travels",
        "image":"fourkube2.jpg",
        "url":"https://www.fourkube.info"
      },
      {
        "title":"Art Alchemy: Web-Scraping Reddit data, Generative AI",
        "category":"(offline now) A fighting gear company I started",
        "image":"art_alchemy.jpg",
        "url":"https://youtu.be/wCyij0mym7s"
      },
      {
        "title":"RecycleRewards: AWS, Python Django, React, Full Stack",
        "category":"(MVP Only) A React and Meteor based chat University project.",
        "image":"recycle_rewards.jpg",
        "url":"https://www.youtube.com/watch?v=oieDlVNgPHA"
      },
      {
        "title":"'How To' Web-Scrape Youtube Tutorial I made",
        "category":"A React based resume website template",
        "image":"webscraping_tutorial.jpg",
        "url":"https://youtu.be/qeCXIG3kUr8?si=xQ1V4I7Rkhll4H5u"
      },
      {
        "title":"My Previous Personal Website (See Older Projects)",
        "category":"(MVP Only) A React and Meteor based chat University project.",
        "image":"older_personal_website.jpg",
        "url":"https://www.ryandundun.com"
      },
      {
        "title":"My AWS Certification: Solutions Architect CO2",
        "category":"Website I built for a restaurant I like in Thailand",
        "image":"aws_certification.jpg",
        "url":"https://ryandundun.com/AWS_SAA.pdf"
      }
    ]
  }
}
